Revit 2027 API
Application.ShortCurveTolerance Property
 The enforced minimum length for any curve created by Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ShortCurveTolerance { get; }
Public ReadOnly Property ShortCurveTolerance As Double
	Get
public:
property double ShortCurveTolerance {
	double get ();
}
member ShortCurveTolerance : float with get
Property Value
Double
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace